In [131]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

[autoreload of tasks failed: Traceback (most recent call last):
  File "/Users/larswaage/Code/large-distributed-data/.venv/lib/python3.11/site-packages/IPython/extensions/autoreload.py", line 276, in check
    superreload(m, reload, self.old_objects)
  File "/Users/larswaage/Code/large-distributed-data/.venv/lib/python3.11/site-packages/IPython/extensions/autoreload.py", line 500, in superreload
    update_generic(old_obj, new_obj)
  File "/Users/larswaage/Code/large-distributed-data/.venv/lib/python3.11/site-packages/IPython/extensions/autoreload.py", line 397, in update_generic
    update(a, b)
  File "/Users/larswaage/Code/large-distributed-data/.venv/lib/python3.11/site-packages/IPython/extensions/autoreload.py", line 349, in update_class
    if update_generic(old_obj, new_obj):
       ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/Users/larswaage/Code/large-distributed-data/.venv/lib/python3.11/site-packages/IPython/extensions/autoreload.py", line 397, in update_generic
    update(a, b)
  File "/Users/larswaage/Code/large-distributed-data/.venv/lib/python3.11/site-packages/IPython/extensions/autoreload.py", line 309, in update_function
    setattr(old, name, getattr(new, name))
ValueError: task7() requires a code object with 0 free vars, not 1
]

## Evaluation Criteria
- The import of data into the database should work correctly
- The implemented functionality/queries should work correctly as desribed by problem text
- The implemented functionality/queries should be clear and easy to understand
- The efficiency of the code is not considered as an evaluation criteria in this exercise
- The connection to programming language should be clear and easy to understand
- The code should be implemented by the group members and for this exercise, i.e. copying code from
  others or by the use of AI tools (CoPilot, ChatGPT and similar) is considered as cheating
- Clear and understandable report as described by the problem text

In [132]:
import database
import pandas as pd

In [133]:
db_conn = database.CustomDbConnector()

You are connected to the database: mongo
-----------------------------------------------

## Part 1, import

In [134]:
import importer

In [135]:
imprt = importer.Importer(db_conn.db)

In [136]:
imprt.import_with_backreferences()

----------------------Starting import_with_backreferences-----------------------
----------------Finished import_with_backreferences in 16.766 ms----------------

/Users/larswaage/Code/large-distributed-data/src/mongodb/importer.py:388: UserWarning: Already imported, run `wipe_collections` and try again

### Samples

In [137]:
imprt.user_sample()

------------------------------Starting user_sample------------------------------
------------------------Finished user_sample in 5.885 ms------------------------

   _id  has_labels                                         activities
0    0       False  [653a47d4bbfbad7ae9d9153c, 653a47d4bbfbad7ae9d...
1    1       False  [653a47d5bbfbad7ae9d915d7, 653a47d5bbfbad7ae9d...
2    2       False  [653a47d6bbfbad7ae9d91610, 653a47d6bbfbad7ae9d...
3    3       False  [653a47d7bbfbad7ae9d916a2, 653a47d7bbfbad7ae9d...
4    4       False  [653a47d8bbfbad7ae9d917a7, 653a47d8bbfbad7ae9d...
5    5       False  [653a47dabbfbad7ae9d91901, 653a47dabbfbad7ae9d...
6    6       False  [653a47dbbbfbad7ae9d9194a, 653a47dbbbfbad7ae9d...
7    7       False  [653a47dbbbfbad7ae9d91962, 653a47dbbbfbad7ae9d...
8    8       False  [653a47dbbbfbad7ae9d9198a, 653a47dbbbfbad7ae9d...
9    9       False  [653a47dbbbfbad7ae9d919a1, 653a47dbbbfbad7ae9d...

In [138]:
imprt.activity_sample()

----------------------------Starting activity_sample----------------------------
---------------------Finished activity_sample in 13.701 ms----------------------

,_id,user_id,start_datetime,end_datetime,transportation_mode,track_points
0,653a47d4bbfbad7ae9d9153c,0,2009-04-12 07:33:03,2009-04-12 17:24:59,,"[653a4858bbfbad7ae9d953ec, 653a4858bbfbad7ae9d..."
1,653a47d4bbfbad7ae9d9153d,0,2009-05-10 02:02:06,2009-05-10 06:20:11,,"[653a4858bbfbad7ae9d95ac6, 653a4858bbfbad7ae9d..."
2,653a47d4bbfbad7ae9d9153e,0,2008-12-01 11:18:27,2008-12-01 11:35:15,,"[653a4858bbfbad7ae9d95df7, 653a4858bbfbad7ae9d..."
3,653a47d4bbfbad7ae9d9153f,0,2009-06-21 10:14:07,2009-06-21 14:47:12,,"[653a4858bbfbad7ae9d95eae, 653a4858bbfbad7ae9d..."
4,653a47d4bbfbad7ae9d91540,0,2008-12-11 12:14:32,2008-12-11 12:24:32,,"[653a4858bbfbad7ae9d965f6, 653a4858bbfbad7ae9d..."
5,653a47d4bbfbad7ae9d91541,0,2009-06-29 01:16:30,2009-06-29 11:13:12,,"[653a4858bbfbad7ae9d9666f, 653a4858bbfbad7ae9d..."
6,653a47d4bbfbad7ae9d91542,0,2009-05-09 18:16:36,2009-05-09 18:30:36,,"[653a4858bbfbad7ae9d96e31, 653a4858bbfbad7ae9d..."
7,653a47d4bbfbad7ae9d91543,0,2009-07-03 00:28:00,2009-07-03 08:37:23,,"[653a4858bbfbad7ae9d96ede, 653a4858bbfbad7ae9d..."
8,653a47d4bbfbad7ae9d91544,0,2009-06-07 07:52:55,2009-06-07 09:46:03,,"[653a4858bbfbad7ae9d975da, 653a4858bbfbad7ae9d..."
9,653a47d4bbfbad7ae9d91545,0,2009-06-11 22:12:04,2009-06-11 22:34:54,,"[653a4858bbfbad7ae9d97860, 653a4858bbfbad7ae9d..."

In [139]:
imprt.track_point_sample()

--------------------------Starting track_point_sample---------------------------
--------------------Finished track_point_sample in 9.757 ms---------------------

,_id,datetime,latitude,longitude,altitude,location,activity_id,user_id,transportation_mode
0,653a4858bbfbad7ae9d953ec,2009-04-12 07:33:03,40.000017,116.327479,105.0,"{'type': 'Point', 'coordinates': [116.327479, ...",653a47d4bbfbad7ae9d9153c,000,
1,653a4858bbfbad7ae9d953ed,2009-04-12 07:33:09,40.000168,116.327474,80.0,"{'type': 'Point', 'coordinates': [116.327474, ...",653a47d4bbfbad7ae9d9153c,000,
2,653a4858bbfbad7ae9d953ee,2009-04-12 07:33:14,40.000055,116.327454,99.0,"{'type': 'Point', 'coordinates': [116.327454, ...",653a47d4bbfbad7ae9d9153c,000,
3,653a4858bbfbad7ae9d953ef,2009-04-12 07:33:19,40.000021,116.327407,109.0,"{'type': 'Point', 'coordinates': [116.327407, ...",653a47d4bbfbad7ae9d9153c,000,
4,653a4858bbfbad7ae9d953f0,2009-04-12 07:33:24,40.000035,116.327281,111.0,"{'type': 'Point', 'coordinates': [116.327281, ...",653a47d4bbfbad7ae9d9153c,000,
5,653a4858bbfbad7ae9d953f1,2009-04-12 07:33:29,39.999983,116.327285,114.0,"{'type': 'Point', 'coordinates': [116.327285, ...",653a47d4bbfbad7ae9d9153c,000,
6,653a4858bbfbad7ae9d953f2,2009-04-12 07:33:34,39.999853,116.327267,120.0,"{'type': 'Point', 'coordinates': [116.327267, ...",653a47d4bbfbad7ae9d9153c,000,
7,653a4858bbfbad7ae9d953f3,2009-04-12 07:33:39,39.999745,116.327165,125.0,"{'type': 'Point', 'coordinates': [116.327165, ...",653a47d4bbfbad7ae9d9153c,000,
8,653a4858bbfbad7ae9d953f4,2009-04-12 07:33:44,39.999661,116.326997,126.0,"{'type': 'Point', 'coordinates': [116.326997, ...",653a47d4bbfbad7ae9d9153c,000,
9,653a4858bbfbad7ae9d953f5,2009-04-12 07:33:49,39.999528,116.326873,127.0,"{'type': 'Point', 'coordinates': [116.326873, ...",653a47d4bbfbad7ae9d9153c,000,

## Part 2, tasks

### Setup

In [140]:
import tasks
task = tasks.Task(db_conn.db)

### Task 1

In [141]:
t1 = task.task1()
t1

---------------------------------Starting task1---------------------------------

-------------------------Finished task1 in 2282.225 ms--------------------------

   # users  # activities  # track points
0      182         16048         9681756

### Task 2

In [142]:
t2 = task.task2()
t2

---------------------------------Starting task2---------------------------------
---------------------------Finished task2 in 6.755 ms---------------------------

   min_activity_count  max_activity_count  avg_activity_count
0                   0                2102           88.175824

### Task 3

In [143]:
t3 = task.task3()
t3

---------------------------------Starting task3---------------------------------
---------------------------Finished task3 in 2.118 ms---------------------------

    _id  activity_count
0   128            2102
1   153            1793
2    25             715
3   163             704
4    62             691
5   144             563
6    41             399
7    85             364
8     4             346
9   140             345
10  167             320
11   68             280
12   17             265
13    3             261
14   14             236
15  126             215
16   30             210
17  112             208
18   11             201
19   39             198

### Task 4

In [144]:
t4 = task.task4()
t4

---------------------------------Starting task4---------------------------------
---------------------------Finished task4 in 8.774 ms---------------------------

   Users Who Have Taken a Taxi
0                           10
1                           58
2                           62
3                           78
4                           80
5                           85
6                           98
7                          111
8                          128
9                          163

### Task 5

In [145]:
t5 = task.task5()
t5

---------------------------------Starting task5---------------------------------
---------------------------Finished task5 in 6.452 ms---------------------------

        _id  transportation_mode_count
0      walk                        481
1       car                        419
2      bike                        262
3       bus                        199
4    subway                        133
5      taxi                         37
6  airplane                          3
7     train                          2
8      boat                          1
9       run                          1

### Task 6

#### Task 6a

In [146]:
t6a = task.task6a()
t6a

--------------------------------Starting task6a---------------------------------
--------------------------Finished task6a in 17.222 ms--------------------------

   activityCount  year
0           5895  2008

#### Task 6b

In [147]:
t6b = task.task6b()
t6b

--------------------------------Starting task6b---------------------------------
--------------------------Finished task6b in 15.133 ms--------------------------

     totalHours  year
0  11612.423889  2009

### Task 7

In [148]:
t7 = task.task7()
t7

---------------------------------Starting task7---------------------------------
-------------------------Finished task7 in 2294.037 ms--------------------------

   Total Distance Walked by User 112 in 2008 (km)
0                                      115.601375

### Task 8

In [149]:
t8 = task.task8()
with pd.set_option("display.float_format", "{:,.2f}".format):
    t8

---------------------------------Starting task8---------------------------------
Fetching track points
Loading into DataFrame
Calculating the change in altitude between track points
Comparing activity_ids
Create filter for positive Δ altitude
Create filter for positive Δ altitude and same activity
Summing the total altitude gain, grouped by user
Sorting by total meters gained, descending
------------------------Finished task8 in 300166.172 ms-------------------------

      id  total meters gained per user
126  128                  2.135669e+06
147  153                  1.820737e+06
4    004                  1.089358e+06
41   041                  7.899241e+05
3    003                  7.666130e+05
..   ...                           ...
138  141                  0.000000e+00
67   068                  0.000000e+00
152  159                  0.000000e+00
130  132                  0.000000e+00
129  131                  0.000000e+00

[173 rows x 2 columns]

### Task 9

In [150]:
t9 = task.task9()
t9

---------------------------------Starting task9---------------------------------
Fetching track points
Loading into DataFrame
Convert datetime to datetime
Find time diff
Find indices where time diff exceeds 5 minutes
Find indices where activity id is equal to the previous index
Find indices where activity id is the same as the previous index AND the time difference exceeds 5 minutes
Find all invalid track points
Drop duplicates on activity id
Group by user and count the number of activity ids
------------------------Finished task9 in 137091.973 ms-------------------------

         activity_id
user_id
000              101
001               45
002               98
003              179
004              219
...              ...
175                4
176                8
179               28
180                2
181               14

[171 rows x 1 columns]

### Task 10

In [151]:
t10 = task.task10()
t10

--------------------------------Starting task10---------------------------------
-------------------------Finished task10 in 6705.982 ms-------------------------

   Users in the Forbidden City
0                          004
1                          018
2                          019
3                          025
4                          052
5                          062
6                          119
7                          128
8                          131
9                          136
10                         140
11                         144
12                         153
13                         163
14                         168
15                         169

### Task 11

In [152]:
t11 = task.task11()
t11

--------------------------------Starting task11---------------------------------
-------------------------Finished task11 in 297.755 ms--------------------------

    user_id most_used_transportation_mode  transportation_mode_count
0        10                          taxi                          3
1        20                          bike                         80
2        21                          walk                          1
3        52                           bus                          1
4        56                          bike                         15
5        58                          taxi                          2
6        60                          walk                          1
7        62                           bus                        173
8        64                          bike                          1
9        65                          walk                         10
10       67                          walk                          1
11       69                          bike                          1
12       73                           bus                         52
13       75                          walk                          1
14       76                           car                          3
15       78                          walk                         37
16       80                          taxi                          1
17       81                          bike                          4
18       82                          walk                          2
19       84                        subway                          9
20       85                        subway                         18
21       86                          walk                          2
22       87                          walk                          5
23       89                          walk                          7
24       91                           bus                          2
25       92                          walk                          1
26       97                          bike                          9
27       98                          taxi                          1
28      101                           car                          3
29      102                          bike                          7
30      107                          walk                          1
31      108                          bike                          2
32      111                          taxi                          3
33      112                           bus                         69
34      115                          walk                         80
35      117                          walk                          1
36      125                           bus                          3
37      126                          walk                         13
38      128                        subway                        312
39      136                          walk                          3
40      138                          bike                          2
41      139                          bike                          4
42      144                          walk                          2
43      153                          walk                          5
44      161                          walk                          1
45      163                          bike                         26
46      167                          walk                         31
47      175                           bus                          1